app/controllers/games_controller.rb

INSERT INTO "games" ("title", "year", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @game = Game.new(game_params)
    @game.user_id = current_user.id
    respond_to do |format|
      if @game.save

UPDATE "games" SET "year" = $1, "updated_at" = $2 WHERE "games"."id" = $3  [["year", 2018], ["updated_at", "2018-12-05 03:14:34.174218"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @game.update(game_params)

DELETE FROM "games" WHERE "games"."id" = $1  [["id", 2]]
---
  def destroy
    @game.destroy